[
  {
    "name": "ServiceNow CMDB",
    "safeguard_id": "1.1",
    "response": "Our Configuration Management Database provides comprehensive asset lifecycle management with automated discovery, detailed hardware and software inventory tracking, enterprise asset ownership records, departmental assignments, and documented bi-annual review processes for complete enterprise visibility."
  },
  {
    "name": "Microsoft Entra ID", 
    "safeguard_id": "5.1",
    "response": "Centralized identity management with automated user provisioning, comprehensive account lifecycle management, detailed user directories with departmental tracking, role-based access controls, and automated quarterly access reviews with full compliance reporting and audit trails."
  },
  {
    "name": "Okta Universal Directory",
    "safeguard_id": "6.3", 
    "response": "Enterprise-grade multi-factor authentication for all externally-exposed applications with adaptive authentication policies, risk-based assessments, comprehensive SSO integration, and detailed MFA compliance reporting across all access points."
  },
  {
    "name": "Rapid7 InsightVM",
    "safeguard_id": "7.1",
    "response": "Continuous vulnerability management with automated scanning, comprehensive vulnerability assessment, detailed remediation guidance, patch deployment tracking, and complete vulnerability lifecycle management with governance workflows and compliance reporting."
  },
  {
    "name": "Nessus Professional",
    "safeguard_id": "1.1", 
    "response": "During vulnerability assessments, we perform comprehensive network discovery and maintain detailed device databases with operating system detection, service enumeration, and hardware fingerprinting for enhanced security visibility."
  },
  {
    "name": "Splunk Enterprise Security",
    "safeguard_id": "5.1",
    "response": "Our SIEM platform provides detailed account activity monitoring, user behavior analytics, privileged account tracking, and comprehensive identity-related event correlation with audit reporting and compliance dashboards."
  }
]